# SQL USANDO SQLITE EN PYTHON   

Vamos a practicar con los ejemplos realizadas durante el curso "SQL for Data Science Interviews" de Tina Huang de inicio a fin

# Importación de librerías

In [42]:
import pandas as pd 
import numpy as np 
import sqlite3  # Importamos la librería sqlite
import csv

# Instanciando BBDD

In [43]:
# Conectamos con la base de datos data.db
connection = sqlite3.connect("data.db")

# Obtenemos un cursor que utilizaremos para hacer las queries
cursor = connection.cursor()

# Función para interactuar con la BBDD

In [44]:
# Con esta función leemos los datos y lo pasamos a un DataFrame de Pandas
def sql_query(query):

    # Ejecutamos la query
    cursor.execute(query)

    # Almacenamos los datos de la query 
    ans = cursor.fetchall()

    # Obtenemos los nombres de las columnas de la tabla
    names = [description[0] for description in cursor.description]

    return pd.DataFrame(ans,columns=names)

In [45]:
# Ejecutamos la query para obtener los nombres de las tablas dentro de la base de datos(master)
sql_code = cursor.execute(''' SELECT name FROM sqlite_master WHERE type='table' ''')

# Aplicamos un loop para mostrar los nombres de las tablas
for name in sql_code:
  print(name[0])

# Ya que estamos creando la base de datos, no tiene tablas dentro

post_events
eu_energy
asia_energy
na_energy
account_status
request_logs
twitter_employee
users
comments
transactions
web_log
customers
orders

# Creando las tablas e insertando valores

Para crear tablas e insertar datos, podemos usar 'cursor.execute' y ejecutar acciones de forma individual, pero ya que queremos mostrar el script de creación e inserción de datos por cada tabla, usamos 'executescript'

In [46]:
query_table_post_events=''' create table if not exists post_events (user_id int ,
                                                                    created_at date , 
                                                                    event_name varchar(20)) ;

-- No olvidemos que cuando tenemos más de una instrucción, debemos separarlos por punto y coma

insert into post_events values (1, '2020-06-01', 'enter'),
                                (1, '2020-06-01', 'post'),
                                (2, '2020-06-01', 'enter'),
                                (2, '2020-06-01', 'cancel'),
                                (2, '2020-06-01', 'enter'),
                                (2, '2020-06-01', 'cancel'),
                                (1, '2020-06-02', 'enter'),
                                (1, '2020-06-02', 'cancel'),
                                (3, '2020-06-02', 'enter'),
                                (3, '2020-06-02', 'post'),
                                (1, '2020-06-03', 'enter'),
                                (1, '2020-06-03', 'cancel'),
                                (3, '2020-06-03', 'enter'),
                                (3, '2020-06-03', 'cancel');'''
                                
cursor.executescript(query_table_post_events)

In [47]:
query_eu_energy='''create table if not exists eu_energy (date date, 
                        consumption int);

insert into eu_energy values ('2019-06-01', 10),
                               ('2019-06-02', 11),
                               ('2019-06-03', 20),
                               ('2019-06-04', 10),
                               ('2019-06-05', 10),
                               ('2019-06-06', 10);'''

cursor.executescript(query_eu_energy)

In [48]:
 query_asia_energy= '''create table if not exists asia_energy (date date, 
                            consumption int
  );

insert into asia_energy values ('2019-06-01', 44),
                                ('2019-06-02', 30),
                                ('2019-06-03', 12),
                                ('2019-06-04', 30),
                                ('2019-06-05', 30),
                                ('2019-06-06', 44);

'''
cursor.executescript(query_asia_energy)

In [49]:
query_na_energy='''create table if not exists na_energy (date date, 
                        consumption int);

insert into na_energy values ('2019-06-01', 29),
                             ('2019-06-02', 30),
                             ('2019-06-03', 29),
                             ('2019-06-04', 29),
                             ('2019-06-05', 29),
                             ('2019-06-06', 29);'''
cursor.executescript(query_na_energy)

In [50]:
query_account_status='''create table if not exists account_status ( acc_id int, 
                                                        date date, 
                                                        status varchar(20) );

insert into account_status values (1, '2020-01-07', 'open'),
                                  (2, '2020-01-07', 'open'),
                                  (3, '2020-01-07', 'open'),
                                  (4, '2020-01-07', 'open'),
                                  (1, '2020-01-08', 'open'),
                                  (2, '2020-01-08', 'closed'),
                                  (3, '2020-01-08', 'open'),
                                  (4, '2020-01-08', 'open'),
                                  (1, '2020-01-09', 'open'),
                                  (2, '2020-01-09', 'closed'),
                                  (3, '2020-01-09', 'open'),
                                  (4, '2020-01-09', 'closed'),
                                  (1, '2020-01-10', 'open'),
                                  (2, '2020-01-10', 'open'),
                                  (3, '2020-01-10', 'open'),
                                  (4, '2020-01-10', 'closed');'''

cursor.executescript(query_account_status)

In [51]:
query_request_logs='''create table if not exists request_logs ( request_id int, 
                                                  request_date date, 
                                                  request_status varchar(20), 
                                                  distance_to_travel float, 
                                                  monetary_cost float, 
                                                  driver_to_client_distance float );


insert into request_logs values (1, '2020-01-07', 'success', 15, 22, 4),
                                  (2, '2020-01-09', 'success', 12, 10, 9),
                                  (3, '2020-01-11', 'success', 9, 4, 4),
                                  (4, '2020-01-21', 'canceled_by_driver', 13, 11, 40), 
                                  (5, '2020-02-07', 'success', 15, 22, 4),
                                  (6, '2020-02-09', 'canceled_by_client', 20, 32, 50),
                                  (7, '2020-02-11', 'success', 56, 60, 1),
                                  (8, '2020-02-21', 'canceled_by_driver', 3, 5, 99),   
                                  (9, '2020-03-07', 'success', 15, 22, 4),
                                  (10, '2020-03-09', 'success', 12, 10, 9),
                                  (11, '2020-03-11', 'success', 9, 4, 4),
                                  (12, '2020-03-21', 'canceled_by_client', 13, 11, 40), 
                                  (13, '2020-04-07', 'success', 15, 22, 4),
                                  (14, '2020-04-09', 'success', 16, 9, 1),
                                  (15, '2020-04-11', 'success', 18, 25, 6),
                                  (16, '2020-04-21', 'canceled_by_driver', 88, 121, 6);'''

cursor.executescript(query_request_logs)

In [52]:
query_twitter_employee='''create table if not exists twitter_employee (id int,
                                                        first_name varchar(50),
                                                        last_name varchar(50),
                                                        age int,
                                                        sex varchar(10),
                                                        employee_title varchar(50),
                                                        department varchar(50),
                                                        salary int,
                                                        target int,
                                                        bonus int,
                                                        email varchar(50),
                                                        city varchar(20),
                                                        address varchar(100),
                                                        manager_id int
                                                        );

insert into twitter_employee values (1, 'Jacob', 'Smith', 28, 'male', 'software engineer', 'tech', 80000, 82000, 10000, 
                                    'jacobsmith@twitter.com','bay area', NULL, 2),
                                      (2, 'Sally', 'White', 33, 'female', 'software engineer manager', 'tech', 110000, 120000, 15000, 
                                    'sallywhite@twitter.com','chicago', NULL, 4),
                                      (3, 'Arvind', 'Agarwal', 45, 'male', 'software engineer', 'tech', 400000, 420000, 50000, 
                                      NULL,'', NULL, 2),
                                      (4, 'Lisa', 'Kim', 28, NULL, 'data scientist', 'tech', 70000, 790000, 12000, 
                                     NULL,'charlotte', NULL, 2),
                                     (5, 'Ajay', 'Khan', 19, NULL, 'product manager intern', 'product', 40000, 40000, NULL, 
                                      NULL,'denver', NULL, NULL),
                                     (6, 'Walter', 'White', 25, NULL, 'project manager', 'product', 100000, 100000, NULL, 
                                     NULL,'toronto', NULL, NULL),
                                     (7, 'Paris', 'Green', 25, NULL, 'product manager', 'product', 100000, 100000, NULL, 
                                      NULL,'toronto', NULL, NULL),
                                     (12, 'Kyle', 'Kyle', 50, NULL, 'product manager', 'product', 1200000, 1200000, NULL, 
                                     NULL,'bay area', NULL, NULL),
                                     (8, 'Kelly', 'James', 19, NULL, NULL, 'hr', 40000, 40000, 20000, 
                                     NULL,NULL, NULL, NULL),
                                     (9, 'Susan', 'Lee', 43, 'female', NULL, 'hr', 60000, 60000, 20000, 
                                     NULL,NULL, NULL, NULL),
                                     (10, 'Jonas', 'Kwan', 25, 'male', NULL, 'hr', 60000, 60000, 20000, 
                                      NULL,NULL, NULL, NULL),
                                     (11, 'Amanda', 'Lee', 40, 'non-binary', 'hr lead', 'hr', 300000, 300000, 30000, 
                                      NULL,NULL, NULL, NULL),
                                     (13, 'Beepbeep', 'Boop', 1, 'male', 'cat', 'entertainment', NULL, NULL, NULL, 
                                      NULL,'chicago', NULL, NULL),
                                     (14, 'Boop', 'Beepbeep', 1, 'female', 'cat', 'entertainment', NULL, NULL, NULL, 
                                    NULL,'chicago', NULL, NULL);'''

cursor.executescript(query_twitter_employee)

In [53]:
query_users='''create table if not exists users (id int,
                                    name varchar(50),
                                    joined_at date,
                                    city_id int,
                                    device int
  );


insert into users values (1, 'Bob Smith', '2018-01-23', 12, 9421),
                          (2, 'Ashley Sparks', '2019-01-01', 12, 9422),
                          (3, 'Donald Rump', '2020-01-14', 11, 9421),
                          (4, 'Jacob Smith', '2018-08-31', 31, 9423),
                          (5, 'Amanda Leon', '2018-04-18', 31, 9424),
                          (6, 'Robert Little', '2018-07-23', 12, 9425),
                          (7, 'Robert Big', '2020-01-31', 12, 9426),
                          (8, 'Stuart Little', '2017-05-17', 11, 1356),
                          (9, 'Samantha Junior', '2018-01-23', 12, 3421),
                          (10, 'Kyle Curry', '2018-01-23', 12, 6537),
                          (11, 'Jay Kim', '2018-01-21', 12, 2952),
                          (12, 'Allen Barbara', '2018-11-25', 12, 6859),
                          (13, 'Kelley Patel', '2011-01-01', 11, 5909),
                          (14, 'Danielle Kaur', '2019-12-23', 12, 4950);'''

cursor.executescript(query_users)

In [54]:
query_comments='''create table if not exists comments (user_id int,
                                        body varchar(500),
                                        created_at date
  );

insert into comments values (1, 'I love cats', '2020-01-23'),
                            (1, 'and dogs!', '2020-01-23'),
                            (1, 'because there is meaning', '2020-01-23'),
                            (7, 'cats are alright', '2020-01-18'),
                            (7, 'no cats are great', '2020-01-05'),
                            (12, 'I like papayas', '2020-01-21'),
                            (12, 'no', '2020-01-31'),
                            (12, 'im being nice', '2020-01-05'),
                            (4, 'no go away', '2020-01-05'),
                            (11, 'good', '2020-01-05'),
                            (11, 'jolly good', '2020-05-05'),
                            (11, 'cauliflower rice', '2020-11-05'),
                            (5, 'data science is great!', '2020-01-11'),
                            (11, 'yeah its alright', '2020-01-11');'''

cursor.executescript(query_comments)

In [55]:
query_transactions=''' create table if not exists transactions (  id int,
                                                    created_at date,
                                                    value int,
                                                    purchase_id int
                                                    );

  insert into transactions values (1, '2020-01-23', 10, 100),
                                  (1, '2020-01-23', 99, 101),
                                  (1, '2020-02-23', 242, 102),
                                  (1, '2020-02-23', 135, 103),
                                  (1, '2020-02-23', 234, 104),
                                  (1, '2020-03-23', 3453, 105),
                                  (1, '2020-04-23', 112, 106),
                                  (1, '2020-04-23', 1453, 107),
                                  (1, '2020-05-23', 4564, 108);'''
cursor.executescript(query_transactions)

In [56]:
a='''select strftime('%s','now')- strftime('%s','1 hour')'''
sql_query(a)

  strftime('%s','now')- strftime('%s','1 hour')
0                                          None

In [57]:
query_web_log='''create table if not exists web_log (user_id int,
                                      timestamp timestamp,
                                      action varchar(20));

INSERT INTO web_log VALUES 
(1, strftime('%Y-%m-%d %H:%M:%S', 'now', '-1 hour', '-30 minutes'), 'page_load'),
(1, strftime('%Y-%m-%d %H:%M:%S', 'now', '-1 hour', '-10 minutes'), 'page_load'),
(1, strftime('%Y-%m-%d %H:%M:%S', 'now', '-1 hour', '-5 minutes'), 'scroll_up'),
(1, strftime('%Y-%m-%d %H:%M:%S', 'now', '-1 hour', '-4 minutes'), 'scroll_down'),
(1, strftime('%Y-%m-%d %H:%M:%S', 'now', '-1 hour', '-3 minutes'), 'scroll_down'),
(1, strftime('%Y-%m-%d %H:%M:%S', 'now', '-1 hour', '-3 minutes'), 'page_exit'),
(2, strftime('%Y-%m-%d %H:%M:%S', 'now', '-3 hour', '-30 minutes'), 'page_load'),
(2, strftime('%Y-%m-%d %H:%M:%S', 'now', '-3 hour', '-10 minutes'), 'page_load'),
(2, strftime('%Y-%m-%d %H:%M:%S', 'now', '-2 hour', '-5 minutes'), 'scroll_up'),
(2, strftime('%Y-%m-%d %H:%M:%S', 'now', '-2 hour', '-4 minutes'), 'scroll_down'),
(2, strftime('%Y-%m-%d %H:%M:%S', 'now', '-2 hour', '-3 minutes', '-4 seconds'), 'scroll_down'),
(2, strftime('%Y-%m-%d %H:%M:%S', 'now', '-2 hour', '-3 minutes', '-1 second'), 'scroll_down'),
(2, strftime('%Y-%m-%d %H:%M:%S', 'now', '-2 hour', '-3 minutes'), 'scroll_down'),
(2, strftime('%Y-%m-%d %H:%M:%S', 'now', '-1 hour'), 'page_exit'),
(2, strftime('%Y-%m-%d %H:%M:%S', 'now', '-1 hour'), 'page_exit'),
(3, strftime('%Y-%m-%d %H:%M:%S', 'now', '-10 days', '-2 hour', '-5 minutes'), 'scroll_down'),
(3, strftime('%Y-%m-%d %H:%M:%S', 'now', '-10 days', '-2 hour', '-4 minutes'), 'scroll_down'),
(4, strftime('%Y-%m-%d %H:%M:%S', 'now', '-13 days', '-21 hours', '-10 minutes'), 'page_load'),
(4, strftime('%Y-%m-%d %H:%M:%S', 'now', '-13 days', '-2 hours', '-4 minutes'), 'scroll_down'),
(4, strftime('%Y-%m-%d %H:%M:%S', 'now', '-13 days', '-2 hours', '-3 minutes'), 'scroll_down');
'''

cursor.executescript(query_web_log)

In [58]:
ss='''select time('now')'''
sql_query(ss)

  time('now')
0    15:21:24

In [59]:
ds='''select * from web_log'''

sql_query(ds)

    user_id            timestamp       action
0         1  2023-12-15 13:36:58    page_load
1         1  2023-12-15 13:56:58    page_load
2         1  2023-12-15 14:01:58    scroll_up
3         1  2023-12-15 14:02:58  scroll_down
4         1  2023-12-15 14:03:58  scroll_down
5         1  2023-12-15 14:03:58    page_exit
6         2  2023-12-15 11:36:58    page_load
7         2  2023-12-15 11:56:58    page_load
8         2  2023-12-15 13:01:58    scroll_up
9         2  2023-12-15 13:02:58  scroll_down
10        2  2023-12-15 13:03:54  scroll_down
11        2  2023-12-15 13:03:57  scroll_down
12        2  2023-12-15 13:03:58  scroll_down
13        2  2023-12-15 14:06:58    page_exit
14        2  2023-12-15 14:06:58    page_exit
15        3  2023-12-05 13:01:58  scroll_down
16        3  2023-12-05 13:02:58  scroll_down
17        4  2023-12-01 17:56:58    page_load
18        4  2023-12-02 13:02:58  scroll_down
19        4  2023-12-02 13:03:58  scroll_down
20        1  2023-12-15 13:51:24    page_load
21        1  2023-12-15 14:11:24    page_load
22        1  2023-12-15 14:16:24    scroll_up
23        1  2023-12-15 14:17:24  scroll_down
24        1  2023-12-15 14:18:24  scroll_down
25        1  2023-12-15 14:18:24    page_exit
26        2  2023-12-15 11:51:24    page_load
27        2  2023-12-15 12:11:24    page_load
28        2  2023-12-15 13:16:24    scroll_up
29        2  2023-12-15 13:17:24  scroll_down
30        2  2023-12-15 13:18:20  scroll_down
31        2  2023-12-15 13:18:23  scroll_down
32        2  2023-12-15 13:18:24  scroll_down
33        2  2023-12-15 14:21:24    page_exit
34        2  2023-12-15 14:21:24    page_exit
35        3  2023-12-05 13:16:24  scroll_down
36        3  2023-12-05 13:17:24  scroll_down
37        4  2023-12-01 18:11:24    page_load
38        4  2023-12-02 13:17:24  scroll_down
39        4  2023-12-02 13:18:24  scroll_down

In [60]:
eee=''' 
select user_id, min(timestamp) as page_load_time
from web_log
where action = 'page_load'
group by user_id
order by user_id;'''

'''select max(timestamp) as page_exit_time
from web_log
where action = 'page_exit'
group by user_id
order by user_id
'''
sql_query(eee)

   user_id       page_load_time
0        1  2023-12-15 13:36:58
1        2  2023-12-15 11:36:58
2        4  2023-12-01 17:56:58

In [61]:
query_customers='''create table if not exists customers (id INTEGER,
                        first_name VARCHAR(20) NOT NULL,
                        last_name VARCHAR(10) NOT NULL,
                        city VARCHAR(20),
                        address VARCHAR(50),
                        phone_number VARCHAR(10),
                        PRIMARY KEY (id)
                        );

INSERT INTO customers VALUES (1, 'John', 'Adam','London', '2020 Park Drive', '9944563214'),
                                (2, 'Sally','Brown','Chicago', NULL, '9594836054'),
                                (7, 'Jim','Tee','Tokyo', '50 North Street', '9594896054'),
                                (3, 'Pauline', 'Jones', NULL, NULL, NULL),
                                (4, 'David', 'White', 'Colorado', NULL, NULL),
                                (5, 'Sal', 'Tan', 'Amsterdam', '10 Amsterdam Road', NULL),
                                (6, 'Karen', 'Lee', 'Kingston', NULL, '4563978500');'''
 
cursor.executescript(query_customers)

IntegrityError: UNIQUE constraint failed: customers.id

In [ ]:
query_orders=''' create table if not exists orders (id INTEGER,
                        cust_id INTEGER NOT NULL,
                        order_date VARCHAR(10) NOT NULL,
                        order_quantity INTEGER NOT NULL,
                        order_details VARCHAR(50),
                        order_cost INTEGER NOT NULL,
                        PRIMARY KEY (id)
  );


INSERT INTO orders VALUES (1, 1,'2019-03-04', 5, 'hat', 20),
                            (2, 1, '2019-03-12', 1, 'sweater', 100),
                            (3, 3, '2019-04-12', 1, 'sweater', 100),
                            (4, 3, '2019-04-12', 2, 'coat', 400),
                            (5, 2, '2019-01-01', 1, 'coat', 400),
                            (6, 6, '2019-04-01', 3, 'shoes', 100),
                            (7, 6, '2019-04-01', 3, 'vest', 200),
                            (8, 6, '2019-04-28', 1, 'vest', 200);'''

cursor.executescript(query_orders)

Guardamos los cambios en la base de datos

In [ ]:
connection.commit()

Cerramos la conexión con la base de datos. Esto es opcional ya que podemos seguir usanod la base de datos luego de guardar los cambios

In [ ]:
# connection.close()

Reiniciamos la conexión

In [ ]:
# connection = sqlite3.connect("data.db")
# cursor = connection.cursor()

Comprobando la creación de tablas

In [ ]:
#Buscamos los nombres de los objetivos tipo table en la base de datos
query=''' select name from sqlite_master where type='table' '''

sql_query(query)

                name
0        post_events
1          eu_energy
2        asia_energy
3          na_energy
4     account_status
5       request_logs
6   twitter_employee
7              users
8           comments
9       transactions
10           web_log
11         customers
12            orders

P1: ¿Cuáles son las tasas de éxito por día?

-- Solución 1

In [ ]:
P1=''' SELECT created_at,
round((count(case when event_name = 'post' then 1 else null end) * 1.00 /
count(case when event_name = 'enter' then 1 else null end)) * 100,2) as  success_rate
FROM post_events
group by created_at
order by created_at'''
sql_query(P1)

   created_at  success_rate
0  2020-06-01         33.33
1  2020-06-02         50.00
2  2020-06-03          0.00

-- Solución 2

In [ ]:
P1_1='''WITH Eventos as(
SELECT created_at, count(event_name) AS count_event
FROM post_events
WHERE event_name = 'enter'	
group by created_at
),
Post as(
SELECT created_at, count(event_name) as count_post
FROM post_events
WHERE event_name = 'post'
group by created_at
) 
select e.created_at, 
round(((p.count_post)*1.00 /e.count_event) * 100,2) as success_rate
from Eventos e join Post p ON (e.created_at = p.created_at)
order by e.created_at'''
sql_query(P1_1)

   created_at  success_rate
0  2020-06-01         33.33
1  2020-06-02         50.00

P2: ¿Qué día de la semana tiene la tasa de éxito más baja?   

Solución:

In [ ]:
P2='''SELECT strftime('%w', created_at) as day_of_week, 
            round((count(case when event_name = 'post' then 1 else null end) * 1.00 /
            count(case when event_name = 'enter' then 1 else null end)) * 100,2) as  success_rate
FROM post_events
group by 1
order by 2 asc '''
sql_query(P2)

  day_of_week  success_rate
0           3          0.00
1           1         33.33
2           2         50.00

P3: Encuentre la fecha con el mayor consumo total de energía de nuestros centros de datos, imprima la fecha junto con la energía total consumida en todos los centros de datos  
Tablas: eu_energia, asia_energia, na_energia

Solución propuesta en el curso:

In [ ]:
P3_1='''WITH total as (
SELECT *
FROM na_energy
UNION ALL 
SELECT *
FROM asia_energy
UNION ALL 
SELECT *
FROM eu_energy
),
sum_consumption as (
select t.date, sum(t.consumption)  as total_consumption
from total t
group by t.date
)
select s.date, s.total_consumption
from sum_consumption s
where s.total_consumption = (select max(total_consumption) from sum_consumption)'''

sql_query(P3_1)

         date  total_consumption
0  2019-06-01                 83
1  2019-06-06                 83

P4: Calcule el porcentaje de cuentas que se cerraron el 10 de enero de 2020   
tabla: account_status

In [ ]:
P4_1='''SELECT 
(count(case when status = 'closed' then 1 else null end) * 1.00 / 
(count(case when status = 'closed' then 1 else null end) + 
count(case when status = 'open' then 1 else null end)) ) * 100 as percentage 
FROM account_status
where date = '2020-01-10'  ''';

sql_query(P4_1)

   percentage
0        25.0

In [ ]:
P4_2='''    
SELECT 
round(count(case when status = 'closed' then 1 else null end) * 1.00 / 
count(case when status = 'closed' or status = 'open' then 1 else null end) * 100 , 2) as percentage
FROM account_status
where date = '2020-01-10'  '''

sql_query(P4_2)

   percentage
0        25.0

P5: Encuentre los tres mejores salarios de cada departamento, mostrar los resultados alfabéticamente por departamento y por sueldo mayor a menor.   
tabla: twitter_employee

In [ ]:
P5= ''' with ranked as(
SELECT department, salary, 
DENSE_RANK() OVER(PARTITION BY department ORDER BY salary DESC) AS rank_salaries
FROM twitter_employee
)
select department, salary, rank_salaries
from ranked 
where rank_salaries <= 3 and salary is not null	
order by department, salary desc '''

sql_query(P5)

   department   salary  rank_salaries
0          hr   300000              1
1          hr    60000              2
2          hr    60000              2
3          hr    40000              3
4     product  1200000              1
5     product   100000              2
6     product   100000              2
7     product    40000              3
8        tech   400000              1
9        tech   110000              2
10       tech    80000              3

P6: Para cada fecha, encuentra la diferencia entre la distancia por dólar para esa fecha y el promedio de distancia por dólar para ese año/mes. Suponga que todas las fechas son únicas en el conjunto de datos y también cuente los viajes fallidos.   
tabla: request_logs

In [ ]:
P6='''SELECT request_date,  
ROUND(ABS(CAST(distance_to_travel / monetary_cost -
AVG(distance_to_travel / monetary_cost) OVER(PARTITION BY strftime('%Y-%m', request_date)) AS REAL)),2) as difference
FROM request_logs
ORDER BY request_date;
'''

sql_query(P6)

   request_date  difference
0    2020-01-07        0.65
1    2020-01-09        0.13
2    2020-01-11        0.92
3    2020-01-21        0.15
4    2020-02-07        0.03
5    2020-02-09        0.09
6    2020-02-11        0.22
7    2020-02-21        0.11
8    2020-03-07        0.65
9    2020-03-09        0.13
10   2020-03-11        0.92
11   2020-03-21        0.15
12   2020-04-07        0.29
13   2020-04-09        0.80
14   2020-04-11        0.26
15   2020-04-21        0.25

P7: Usted es un científico de datos en una empresa que ejecuta una plataforma de redes sociales.La empresa quiere echar un vistazo al nivel de participación en su plataforma. Calcular la distribución de comentarios por el conteo de usuarios que se unieron la plataforma entre 2018 y 2020, solo para el mes de enero 2020.  
-- Ordenar la salida desde el menor número de comentarios hasta el más alto   
-- tablas: users, comments   

-- Solución:  
-- contar los comentarios y la cantidad de usuarios que hicieron esos comentarios, solo para enero 2020   
-- solo aquellos usuarios que se unieron entre 2018 y 2020   
-- solo aquellos usuarios que su fecha de union sea anterior a la del posteo    
-- ordenar de la menor cantidad de comentarios a la mayor

In [ ]:
P7='''with tmp as (
SELECT c.user_id , count(body) as total_comments
FROM comments c
JOIN users u ON (u.id = c.user_id)
where u.joined_at between '2018-01-01'   and '2020-12-31' 
AND created_at > joined_at 
AND created_at between '2020-01-01' and '2020-01-31' 
group by user_id
)
select 
count(user_id) as num_users , total_comments as num_comments
from tmp
group by num_comments
order by num_comments'''

sql_query(P7)

   num_users  num_comments
0          2             1
1          1             2
2          2             3

P8: Obtenga  el cambio porcentual mensual en los ingresos. La tabla de salida debe tener la forma de año y mes y el cambio porcentual,redondear a 2 decimales y ordenar desde el comienzo del año hasta el final del año.  
--Tabla: transactions

In [ ]:
PB='''

SELECT strftime('%Y-%m',created_at) as month_year, 
SUM(value) as total_consumption
FROM transactions
GROUP BY 1;'''

sql_query(PB)

  month_year  total_consumption
0    2020-01                109
1    2020-02                611
2    2020-03               3453
3    2020-04               1565
4    2020-05               4564

In [ ]:
P8= """
    SELECT 
        strftime('%Y-%m', created_at) as month_year, 
        ROUND(
            (SUM(value) - LAG(SUM(value), 1, 0) OVER(ORDER BY strftime('%Y-%m-01', created_at))) /
            NULLIF(LAG(SUM(value), 1, 1) OVER(ORDER BY strftime('%Y-%m-01', created_at)), 0) * 100
        , 2) AS percentage_change
    FROM 
        transactions
    GROUP BY 1 
    ORDER BY 1
"""
sql_query(P8)

  month_year  percentage_change
0    2020-01            10900.0
1    2020-02              400.0
2    2020-03              400.0
3    2020-04                0.0
4    2020-05              100.0

P9: Desarrolle un pronóstico para una nueva métrica llamada "distancia por dólar" mensual, definida como ((distance_to_travel/monetary_cost)) en nuestro conjunto de datos y mida su precisión. Utilice RSME para evaluar la precisión. (Error de raíz cuadrada media (RMSE) es la desviación estándar)  
-- Tabla: request_logs  
-- POWER():Esta función se usa para encontrar un resultado después de elevar un número de exponente específico a un número base específico.

In [ ]:
P9="""WITH tmp as(
SELECT strftime('%m',request_date) as month_year, 
sum(distance_to_travel)/sum(monetary_cost) as distance_per_dollar_actual
FROM request_logs
group by 1 
),
model as(
SELECT month_year, distance_per_dollar_actual, 
LAG(distance_per_dollar_actual, 1) OVER (ORDER BY month_year) distance_per_dollar_model
FROM tmp
group by 1,2
)
SELECT SQRT(AVG(POWER(distance_per_dollar_actual - distance_per_dollar_model,2))) AS RMSE
FROM model """

sql_query(P9)

       RMSE
0  0.258048

C:\Users\ronal\Documentos\Data_scientist\Github\SQL\Data_Analysis_SQL-main\SQL_Interviews_365_DataScience\solucion.ipynb

P10:Encuentre el cliente con el costo total de pedido más alto entre 2019-02-01 y 2019-05-01. MuestrE su nombre, el costo total de los artículos y la fecha.
--Suponga que cada nombre en el conjunto de datos es único y que los clientes pueden realizar varios pedidos en la misma fecha.
--Tablas: customers, orders

In [ ]:
P10=""" WITH tmp as(
SELECT c.first_name, o.order_date, 
sum((o.order_cost * o.order_quantity)) as total_cost
FROM customers c 
JOIN orders o ON (c.id = o.cust_id)
WHERE order_date between '2019-02-01' and '2019-05-01'
group by 1,2
)
SELECT first_name, order_date, total_cost
FROM tmp
WHERE total_cost = (SELECT MAX(total_cost) FROM tmp)""" 

sql_query(P10)

  first_name  order_date  total_cost
0      Karen  2019-04-01         900
1    Pauline  2019-04-12         900

P11: Ustes es cientifico de datos para una compañia que desea entender mejor el comportamiento de sus usuarios en su plataforma. Obtenga el tiempo de sesión promedio de los usuarios en orden ascendente. Suponga que un usuario tiene solo una sesión por día. La duración de la sesión es (page exit- page load)   
--Tabla: web_log

In [ ]:
P11=''' WITH session_users as(
SELECT a.user_id, a."timestamp" as date_session, 
MIN(b."timestamp" - a."timestamp") as duration 
FROM web_log a 
JOIN web_log b
ON (a.user_id = b.user_id)
where a.action = 'page_load'
and b.action  = 'page_exit'
and b."timestamp"  > a."timestamp"
group by a.user_id, a."timestamp"
)
SELECT user_id,AVG(duration) AS avg_session
FROM session_users
group by user_id
order by avg_session ASC'''
sql_query(P11)

   user_id  avg_session
0        1          0.0
1        2          0.0

In [ ]:
connection.commit()
connection.close()